const MORSE_TABLE = {
    '.-': 'a',
    '-...': 'b',
    '-.-.': 'c',
    '-..': 'd',
    '.': 'e',
    '..-.': 'f',
    '--.': 'g',
    '....': 'h',
    '..': 'i',
    '.---': 'j',
    '-.-': 'k',
    '.-..': 'l',
    '--': 'm',
    '-.': 'n',
    '---': 'o',
    '.--.': 'p',
    '--.-': 'q',
    '.-.': 'r',
    '...': 's',
    '-': 't',
    '..-': 'u',
    '...-': 'v',
    '.--': 'w',
    '-..-': 'x',
    '-.--': 'y',
    '--..': 'z',
    '.----': '1',
    '..---': '2',
    '...--': '3',
    '....-': '4',
    '.....': '5',
    '-....': '6',
    '--...': '7',
    '---..': '8',
    '----.': '9',
    '-----': '0',
};

function decode(expr) {
    //формирую массив из "." и "-"
    const codeArr = expr.match(/.{1,10}/g)  // разделяю по 10 элементов
        .map(elem => {
            elem = elem.replace(/10/g, ".")   //заменяю 10 на "."
                .replace(/11/g, "-")              //заменяю 11 на "-"
                .replace(/0/g, "")                // если 0 то ничего
                .replace(/\*{10}/g, " ");         // 10* пробел
            return elem;
        });
     const charArr = codeArr.map(elem => {      // массив из раскодированных символов
            if(elem !== ' ')
            elem = MORSE_TABLE[elem];
            return elem;
        });
        return charArr.join('');
}

module.exports = {
    decode
}
